iotest-pmem/fio-output2/libaio-irq-randwrite-4K-1-32-log
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.19
Starting 32 processes
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
[...]

test: (groupid=0, jobs=32): err=28 (file:io_u.c:1803, func=io_u error, error=No space left on device): pid=472253: Thu Oct 24 15:09:48 2024
  write: IOPS=284k, BW=1111MiB/s (1165MB/s)(65.1GiB/60001msec); 0 zone resets
    slat (nsec): min=1990, max=276570, avg=2485.75, stdev=1287.78
    clat (nsec): min=529, max=157071, avg=740.90, stdev=92.65
     lat (usec): min=2, max=277, avg= 3.27, stdev= 1.29
    clat percentiles (nsec):
     |  1.00th=[  692],  5.00th=[  708], 10.00th=[  732], 20.00th=[  732],
     | 30.00th=[  740], 40.00th=[  740], 50.00th=[  740], 60.00th=[  740],
     | 70.00th=[  740], 80.00th=[  748], 90.00th=[  748], 95.00th=[  748],
     | 99.00th=[  772], 99.50th=[  852], 99.90th=[ 1224], 99.95th=[ 2736],
     | 99.99th=[ 3824]
   bw (  MiB/s): min=  466, max= 1237, per=100.00%, avg=1113.26, stdev=229.70, samples=119
   iops        : min=119408, max=316790, avg=284994.08, stdev=58804.06, samples=119
  lat (nsec)   : 750=80.53%, 1000=19.28%
  lat (usec)   : 2=0.12%, 4=0.07%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 250=0.01%
  cpu          : usr=15.56%, sys=84.23%, ctx=246, majf=0, minf=763
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,17066894,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1111MiB/s (1165MB/s), 1111MiB/s-1111MiB/s (1165MB/s-1165MB/s), io=65.1GiB (69.9GB), run=60001-60001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%