iotest-pmem/fio-output2/libaio-irq-randwrite-4K-1-4-log
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.19
Starting 4 processes
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
[...]

test: (groupid=0, jobs=4): err=28 (file:io_u.c:1803, func=io_u error, error=No space left on device): pid=471869: Thu Oct 24 15:06:38 2024
  write: IOPS=280k, BW=1094MiB/s (1148MB/s)(64.1GiB/60001msec); 0 zone resets
    slat (nsec): min=1960, max=292470, avg=2503.69, stdev=1285.35
    clat (nsec): min=540, max=142381, avg=756.67, stdev=86.54
     lat (usec): min=2, max=293, avg= 3.31, stdev= 1.28
    clat percentiles (nsec):
     |  1.00th=[  708],  5.00th=[  724], 10.00th=[  740], 20.00th=[  748],
     | 30.00th=[  748], 40.00th=[  748], 50.00th=[  764], 60.00th=[  764],
     | 70.00th=[  764], 80.00th=[  764], 90.00th=[  772], 95.00th=[  772],
     | 99.00th=[  788], 99.50th=[  868], 99.90th=[ 1288], 99.95th=[ 2768],
     | 99.99th=[ 3792]
   bw (  MiB/s): min=  464, max= 1217, per=100.00%, avg=1096.54, stdev=222.93, samples=119
   iops        : min=118962, max=311734, avg=280714.48, stdev=57069.87, samples=119
  lat (nsec)   : 750=13.59%, 1000=86.21%
  lat (usec)   : 2=0.12%, 4=0.07%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 250=0.01%
  cpu          : usr=16.08%, sys=83.72%, ctx=115, majf=0, minf=80
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16809395,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1094MiB/s (1148MB/s), 1094MiB/s-1094MiB/s (1148MB/s-1148MB/s), io=64.1GiB (68.9GB), run=60001-60001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%