iotest-pmem/fio-output2/libaio-irq-randwrite-4K-1-8-log
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.19
Starting 8 processes
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
[...]

test: (groupid=0, jobs=8): err=28 (file:io_u.c:1803, func=io_u error, error=No space left on device): pid=472025: Thu Oct 24 15:07:41 2024
  write: IOPS=284k, BW=1108MiB/s (1162MB/s)(64.9GiB/60001msec); 0 zone resets
    slat (nsec): min=1960, max=291940, avg=2492.92, stdev=1283.60
    clat (nsec): min=530, max=141460, avg=743.59, stdev=82.03
     lat (usec): min=2, max=292, avg= 3.28, stdev= 1.28
    clat percentiles (nsec):
     |  1.00th=[  700],  5.00th=[  708], 10.00th=[  732], 20.00th=[  740],
     | 30.00th=[  740], 40.00th=[  740], 50.00th=[  740], 60.00th=[  740],
     | 70.00th=[  748], 80.00th=[  748], 90.00th=[  748], 95.00th=[  748],
     | 99.00th=[  772], 99.50th=[  860], 99.90th=[ 1224], 99.95th=[ 2768],
     | 99.99th=[ 3824]
   bw (  MiB/s): min=  465, max= 1234, per=100.00%, avg=1110.15, stdev=228.82, samples=119
   iops        : min=119208, max=315992, avg=284199.26, stdev=58577.97, samples=119
  lat (nsec)   : 750=69.57%, 1000=30.24%
  lat (usec)   : 2=0.11%, 4=0.07%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 250=0.01%
  cpu          : usr=15.09%, sys=84.70%, ctx=133, majf=0, minf=173
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,17017996,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1108MiB/s (1162MB/s), 1108MiB/s-1108MiB/s (1162MB/s-1162MB/s), io=64.9GiB (69.7GB), run=60001-60001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%