iotest-pmem/fio-output2/libaio-irq-read-4K-1-1-log
test: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.19
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=469413: Thu Oct 24 14:42:38 2024
  read: IOPS=384k, BW=1500MiB/s (1573MB/s)(87.9GiB/60001msec)
    slat (nsec): min=1400, max=137920, avg=1664.29, stdev=163.93
    clat (nsec): min=540, max=135600, avg=732.52, stdev=93.01
     lat (nsec): min=2010, max=147080, avg=2438.80, stdev=194.29
    clat percentiles (nsec):
     |  1.00th=[  708],  5.00th=[  724], 10.00th=[  724], 20.00th=[  724],
     | 30.00th=[  732], 40.00th=[  732], 50.00th=[  732], 60.00th=[  732],
     | 70.00th=[  732], 80.00th=[  740], 90.00th=[  740], 95.00th=[  740],
     | 99.00th=[  764], 99.50th=[  844], 99.90th=[ 1160], 99.95th=[ 3312],
     | 99.99th=[ 4320]
   bw (  MiB/s): min= 1501, max= 1503, per=100.00%, avg=1502.19, stdev= 0.37, samples=119
   iops        : min=384330, max=384776, avg=384561.87, stdev=95.77, samples=119
  lat (nsec)   : 750=96.82%, 1000=3.02%
  lat (usec)   : 2=0.08%, 4=0.06%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  cpu          : usr=15.90%, sys=83.85%, ctx=64, majf=0, minf=25
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=23038319,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1500MiB/s (1573MB/s), 1500MiB/s-1500MiB/s (1573MB/s-1573MB/s), io=87.9GiB (94.4GB), run=60001-60001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%