iotest-pmem/fio-output2/libaio-irq-read-4K-1-2-log
test: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.19
Starting 2 processes
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping

test: (groupid=0, jobs=2): err= 0: pid=469526: Thu Oct 24 14:43:58 2024
  read: IOPS=795k, BW=3106MiB/s (3256MB/s)(182GiB/60001msec)
    slat (nsec): min=1190, max=96640, avg=1616.71, stdev=171.65
    clat (nsec): min=450, max=103040, avg=694.62, stdev=100.76
     lat (nsec): min=1700, max=105580, avg=2353.10, stdev=220.01
    clat percentiles (nsec):
     |  1.00th=[  620],  5.00th=[  628], 10.00th=[  628], 20.00th=[  644],
     | 30.00th=[  644], 40.00th=[  708], 50.00th=[  724], 60.00th=[  724],
     | 70.00th=[  732], 80.00th=[  732], 90.00th=[  740], 95.00th=[  740],
     | 99.00th=[  748], 99.50th=[  780], 99.90th=[ 1112], 99.95th=[ 2992],
     | 99.99th=[ 4192]
   bw (  MiB/s): min= 2963, max= 3221, per=100.00%, avg=3110.36, stdev=55.17, samples=238
   iops        : min=758622, max=824600, avg=796251.12, stdev=14122.68, samples=238
  lat (nsec)   : 500=0.01%, 750=98.14%, 1000=1.72%
  lat (usec)   : 2=0.07%, 4=0.06%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  cpu          : usr=16.01%, sys=83.75%, ctx=152, majf=0, minf=56
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=47701461,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3106MiB/s (3256MB/s), 3106MiB/s-3106MiB/s (3256MB/s-3256MB/s), io=182GiB (195GB), run=60001-60001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%